In [1]:
import pandas as pd
import numpy as np
import matplotlib as mp

In [5]:
students_mat = pd.read_csv('student-mat.csv',low_memory=False)
students_por = pd.read_csv('student-por.csv',low_memory=False)
students_mat['subject'] = 'mat'
students_por['subject'] = 'por'
students = students_mat.append(students_por)

----
# Estudiantes por escuela

In [6]:
students_por['school'].value_counts()

GP    423
MS    226
Name: school, dtype: int64

----
# Consumo de alcohol por tama√±o de familia

In [7]:
students.groupby('famsize')[['Dalc','Walc','G1','G2','G3']].mean()

             Dalc      Walc         G1         G2         G3
famsize
GT3      1.449864  2.210027  11.102981  11.124661  11.189702
LE3      1.601307  2.464052  11.480392  11.539216  11.709150

In [8]:
students_mat['famsize'].value_counts()

GT3    281
LE3    114
Name: famsize, dtype: int64

-----
# Consumo de alcohol por sexo

In [9]:
students_por.groupby('sex')[['Dalc','Walc']].mean()

         Dalc      Walc
sex
F    1.284595  1.937337
M    1.815789  2.774436

In [10]:
students_mat.groupby('sex')[['Dalc','Walc']].mean()

         Dalc      Walc
sex
F    1.254808  1.956731
M    1.732620  2.663102

-----------------
# Educacion de los padres

In [11]:
students.groupby('Pstatus')[['Medu','Fedu']].mean()

             Medu      Fedu
Pstatus
A        2.842975  2.537190
T        2.572048  2.368364

-------
# Consumo de alcohol por varios buckets

In [12]:
students.groupby('higher')[['Dalc','Walc']].mean()

            Dalc      Walc
higher
no      1.831461  2.651685
yes     1.462827  2.250262

----------
# Ausencias alumnos de areas rurales

In [13]:
students.groupby('address')[['absences']].mean()

         absences
address
R        4.063158
U        4.574440

-----
# Notas alumnos de areas rurales

In [14]:
students.groupby('internet')[['G1','G2','G3']].mean()

                 G1         G2         G3
internet
no        10.603687  10.460829  10.534562
yes       11.373640  11.452237  11.553809

In [15]:
students['G3'].hist(bins=20)

## Alumnos por area de trabajo de padres

In [20]:
students['equal_jobs'] = students['Mjob'] == students['Fjob']
students[students['equal_jobs']].groupby(['Mjob','Fjob'])[['G1','G2','G3']].mean()
students.groupby('equal_jobs')[['G1','G2','G3']].mean()

                   G1         G2         G3
equal_jobs
False       11.163543  11.185690  11.265758
True        11.277899  11.323851  11.439825

------------